_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_20 (LSTM)               (None, 64)                19968     
_________________________________________________________________
dropout_20 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_40 (Dense)             (None, 3)                 99        
=================================================================
Total params: 22,147
Trainable params: 22,147
Non-trainable params: 0
_________________________________________________________________
lstm_20  :  (None, 120, 13)
dropout_20  :  (None, 64)
dense_39  :  (None, 64)
dense_40  :  (None, 32)
