_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_9 (TimeDist (None, None, 27, 64)      3392      
_________________________________________________________________
time_distributed_10 (TimeDis (None, None, 24, 64)      16448     
_________________________________________________________________
time_distributed_11 (TimeDis (None, None, 12, 64)      0         
_________________________________________________________________
time_distributed_12 (TimeDis (None, None, 768)         0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 64)                213248    
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 99        
=================================================================
Total params: 235,267
Trainable params: 235,267
Non-trainable params: 0
_________________________________________________________________
time_distributed_9  :  (None, None, 30, 13)
time_distributed_10  :  (None, None, 27, 64)
time_distributed_11  :  (None, None, 24, 64)
time_distributed_12  :  (None, None, 12, 64)
lstm_3  :  (None, None, 768)
dropout_3  :  (None, 64)
dense_5  :  (None, 64)
dense_6  :  (None, 32)
