_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_3 (Conv1D)            (None, 117, 24)           1272      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 58, 24)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 56, 40)            2920      
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 28, 40)            0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 28, 40)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 28, 32)            9344      
_________________________________________________________________
lstm_3 (LSTM)                (None, 28, 32)            8320      
_________________________________________________________________
lstm_4 (LSTM)                (None, 16)                3136      
_________________________________________________________________
dense_3 (Dense)              (None, 16)                272       
_________________________________________________________________
dense_4 (Dense)              (None, 3)                 51        
=================================================================
Total params: 25,315
Trainable params: 25,315
Non-trainable params: 0
_________________________________________________________________
conv1d_3  :  (None, 120, 13)
max_pooling1d_2  :  (None, 117, 24)
conv1d_4  :  (None, 58, 24)
max_pooling1d_3  :  (None, 56, 40)
dropout_2  :  (None, 28, 40)
lstm_2  :  (None, 28, 40)
lstm_3  :  (None, 28, 32)
lstm_4  :  (None, 28, 32)
dense_3  :  (None, 16)
dense_4  :  (None, 16)
