_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 64)                19968     
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 99        
=================================================================
Total params: 22,147
Trainable params: 22,147
Non-trainable params: 0
_________________________________________________________________
lstm_1  :  (None, 120, 13)
dropout_1  :  (None, 64)
dense_1  :  (None, 64)
dense_2  :  (None, 32)
